/ Author: Josu Muumi
// Version: 6.1.0.0 (04.01.2020)

// General

000 = Suomi
001 = Kyllä
002 = Ei
003 = OK
004 = Sulje
005 = Hallintapaneeli
006 = Sääntöjen hallinta
007 = Selaa sallittava ohjelma
008 = Selaa estettävä ohjelma
009 = Salli ohjelman muodostaa yhteys klikkaamalla sen avointa ikkunaa
010 = Estä ohjelmaa muodostamasta yhteyttä klikkaamalla sen avointa ikkunaa
011 = Tai klikkaa tätä valintaikkunaa peruuttaaksesi toiminnon
012 = Uusi sääntö yhteyksien sallimiselle luotiin onnistuneesti ohjelmalle
013 = Uusi sääntö yhteyksien estämiselle luotiin onnistuneesti ohjelmalle
016 = Säännöt tuotiin onnistuneesti tiedostosta
017 = Säännöt vietiin onnistuneesti tiedostoon
018 = Oletus säännöt palautettiin onnistuneesti.
021 = Määritä koko sijainti tiedostolle, jolle sääntö tehdään
022 = Osittaiset sääntöjen määritykset tuotiin onnistuneesti tiedostosta
023 = Osittaiset sääntöjen määritykset vietiin onnistuneesti tiedostoon
024 = Sääntöjen tuonti epäonnistui
025 = Sääntöjen vienti epäonnistui
028 = Yhdistetty verkkoalueeseen
029 = Käyttöohje
030 = Lukitse Windowsin palomuurin tila
031 = Poista Windowsin palomuurin tilan lukitus
032 = Lukitse
033 = Poista lukitus
034 = Peruuta
035 = Aseta salasana
036 = Anna salasana lukituksen poistamiseen
037 = Väärä salasana
038 = Näytä salasana
039 = Vieraile kehittäjän sivuilla
040 = Hallitse Windowsin palomuurin sääntöjä
041 = Paina lukon kuvakkeesta ohjelman lukitukset poistamiseksi
042 = Haluatko varmasti poistaa Windowsin palomuurin suojauksen käytöstä?
043 = Älä näytä uudelleen
044 = Vain luku
045 = Säännön, jonka EdgeTraversal on asetettu kohtaan 'Defer to user', muokkaaminen ei ole täysin tuettu, ja muokkauksen muutokset eivät välttämättä tule voimaan. Päivitä sääntöjen listaus muokkauksen jälkeen ja tarkista, että muutokset tallentuivat. Oletko varma, että haluat jatkaa?
046 = Haluatko varmasti poistaa nämä säännöt?
050 = Lisäominaisuudet
051 = Sääntö sisältää lisäominaisuuksia, jotka ovat muutettavissa vain WFwAS:än kautta
052 = Lukumäärä
053 = Ei yhtään
060 = Päivitä asetukset
061 = Päivitä avattaessa
070 = Hallintanäkymä
071 = Kokeile Malwarebytes Premium
072 = Avaa Malwarebytes
073 = Windowsin palomuurin tila
074 = Päällä
075 = Pois päältä
076 = Saapuvat yhteydet
077 = Lähtevät yhteydet
078 = Salli kaikki
079 = Salli
080 = Estä
081 = Estä kaikki


// Tab items

100 = Profiilit
200 = Ilmoitukset
300 = Asetukset
400 = Säännöt
500 = Työkalut
600 = Tietoja

// Profiles

101 = Suodatuksen taso määrittelee mitkä yhteydet tulisi estää ja mitkä yhteydet tulisi sallia
102 = Korkea suodatus
103 = Kaikki lähtevät ja saapuvat yhteydet estetään. Tämä profiili estää kaikki koneeseen saapuvat ja koneesta lähtevät yhteysyritykset.
104 = Keskitason suodatus (suositeltu)
105 = Lähtevät yhteydet, joille ei ole olemassa sääntöjä, estetään. Vain säännöllä sallitut ohjelmat sallitaan.
106 = Alhainen suodatus
107 = Lähtevät yhteydet, joille ei ole olemassa sääntöjä, sallitaan. Vain säännöllä estetyt ohjelmat estetään.
108 = Ei suodatusta
109 = Windowsin palomuuri kytketään pois päältä. Vältä käyttämästä tätä asetusta, jos sinulla ei ole toista palomuuria käytössä.
110 = Keskitason suodatus
111 = Määritä profiilin palautus, joka palauttaa soudatusprofiilin, mikäli se on vaihdettu alhaisempaan suodatusprofiiliin asennuksen/päivityksen takia
112 = Asetetaan automaattisesti
113 = -
114 = minuuttia

// Notifications

201 = Ilmoituksen taso määrittelee mitkä estetyt lähtevät yhteydet ilmoitetaan käyttäjälle
204 = Näytä ilmoitukset
205 = Näytä ilmoitukset kaikilta estetyiltä lähteviltä yhteyksiltä pois lukien ohjelmilta, jotka on määritetty poikkeuksina alla
206 = Opettelutila
207 = Luo sallintasääntö automaattisesti digitaalisesti allekirjoitetuille ohjelmille, ja näytä ilmoitukset vain allekirjoittamattomille ohjelmille
208 = Poista käytöstä
209 = Älä näytä ilmoituksia.
210 = Ilmoituksen asetukset
211 = Sulje ilmoitus automaattisesti
212 = sekunnissa.
213 = Mukautettu tilapäisten sääntöjen aikakatkaisun viive on
214 = Soita äänimerkki uudelle ilmoitukselle
215 = Soita oletus äänimerkki
216 = Soita omavalintainen äänimerkki
217 = Valitse soitettava ilmoituksen äänimerkki
218 = Ilmoitustoiminto on saatavilla vain rekisteröityneille käyttäjille. Käyttääksesi tätä toimintoa, ole hyvä ja aktivoi ohjelma. Kiitos tuestasi.
219 = Tätä painamalla saat tietoa rekisteröitymisestä
220 = Näytä ilmoitukset muiden ikkunoiden yläpuolella
221 = Ilmoituksen lisäasetukset
222 = Palauta alkuperäiset lisäasetukset
223 = Älä näytä ilmoituksia estetyistä yhteyksistä ohjelmista, joilla on olemassa sallintassääntö. Suositellaan käytettäväksi muiden tietoturvaohjelmien kanssa yhteensopivuuden takaamiseksi, jotta päälekkäisiä ilmoituksia ei näytetä.
224 = Älä näytä ilmoituksia estetyistä yhteyksistä ohjelmista, jotka sisältyvät yhteiseen kaikille ohjelmille tehtyyn estosääntöön.
225 = Älä näytä ilmoituksia estetyistä yhteyksistä ohjelmista, joilla on olemassa käytöstä poistettu sääntö.
230 = Oppimistilan luoma sääntö
240 = Määritä alla ohjelmat ja tiedostosijainnit, joista ilmoituksia ei tulisi näyttää
241 = Ilmoituksen poikkeukset
242 = Lisää poikkeus
243 = Poista poikkeus
244 = Määritä uusi poikkeus tähän
245 = Lisää ilmoituksen poikkeuksiin
246 = Ohita tiedosto
247 = Ohita tiedostosijainti

// Options

301 = Asetukset alla tulevat voimaan kaikille paikallisen tietokoneen käyttäjille
302 = Käyttöliittymään integroiminen
303 = Integroi ohjelma suoritettavien ohjelmien ja niiden pikakuvakkeiden kontekstivalikkoon.
304 = Käynnistä automaattisesti käyttäjän sisäänkirjautuessa
305 = Kun käytössä on nopea käyttäjänvaihto, asetusta käytetään ensimmäisellä käyttäjän kirjautumiskerralla.
308 = Globaalit pikanäppäimet
309 = Globaaleja pikanäppäimiä voit käyttää kaikkien ohjelmien kanssa.
310 = Alla voit määrittää ohjelman ulkoasun asettamalla halutun RGB-väriyhdistelmän.
311 = Punainen
312 = Vihreä
313 = Sininen
314 = Hexaväri
321 = Korkea suodatus profiili on käytössä. Verkkoyhteydet torjutaan, kunnes profiili vaihdetaan manuaalisesti.
324 = Tuo, vie tai palauta käyttäjän asetukset
325 = Tuo käyttäjän asetukset tiedostosta
326 = Vie käyttäjän asetukset tiedostoon
327 = Palauta kaikki asetukset alkuperäisiin arvoihin
328 = Käyttäjän asetukset vietiin onnistuneesti tiedostoon
329 = Hyväksyttyäsi tämän toiminnon, ohjelma käynnistyy uudelleen asetusten uudelleen lataamista varten. Haluatko varmasti jatkaa?
330 = Salli Windowsin palomuurin kautta
331 = Estä Windowsin palomuurin kautta
340 = Käyttöliittymän kieli

// Rules

401 = Valitse yhteyssuunta, johon uudet luotavat säännöt tulevat voimaan:
402 = Lähtevä (suositeltu)
403 = Oletuksena säännöt tehdään vain lähteville yhteyksille, kun uusi sääntö luodaan ohjelman sallimiseksi tai sen estämiseksi.
404 = Saapuva
405 = Oletuksena säännöt tehdään vain saapuville yhteyksille. Käytä asetusta varoen. Saapuvien yhteyksien salliminen vaaditaan yleensä palvelinohjelmille.
406 = Lähtevä ja saapuva
407 = Oletuksena säännöt tehdään molempiin yhteyssuuntiin. Ei suositeltu.
408 = Valitse verkkoalueet, joissa uudet luotavat säännöt tulevat voimaan:
409 = Tuo, vie tai palauta palomuurin säännöt
410 = Tuo Windowsin palomuurin säännöt tiedostosta
411 = Vie Windowsin palomuurin säännöt tiedostoon
412 = Palauta Windowsin palomuurin alkuperäiset säännöt
413 = Palauta Windows Firewall Controllin suositetut säännöt
414 = Täydelliset sääntöjen määritykset sisältävä tiedosto valittiin. Tuomalla palomuurin säännöt tästä tiedostosta, ylikirjoitetaan kaikki nykyiset Windowsin palomuurin säännöt. Jos haluat tallettaa kopion nykyisistä säännöistä, sinun tulee ensin viedä ne tiedostoon. Halautko tuoda palomuurin säännöt valitusta tiedostosta?
415 = Palauttamalla oletus säännöt, häviää kaikki tehdyt muutokset Windowsin palomuurin asetuksiin. Jotkin ohjelmat voivat lakata toimimasta tämän jälkeen. Haluatko varmasti jatkaa?
416 = Tuo tiedostosta...
417 = Vie tiedostoon...
418 = Suositetut säännöt palautettiin onnistuneesti.
419 = Ole hyvä ja päivitä säännöt sääntöjen hallintaikkunassa. Kiitos.
420 = Toiminto poistaa kaikki nykyiset tiedot Windowsin palomuurin lokeista. Haluatko varmasti jatkaa?
421 = Osittaiset sääntöjen määritykset sisältävä tiedosto valittiin. Tuomalla palomuurin säännöt tästä tiedostosta, jätät nykyiset sääntösi ennalleen, ja tässä tiedostossa olevat säännöt lisätään nykyisten sääntöjen rinnalle. Haluatko tuoda palomuurin säännöt valitusta tiedostosta?
422 = Valittu tiedosto on väärää muotoa tai se on viallinen !
423 = WFC:n suositellut säännöt luodaan uudelleen. Nykyiset olemassa olevat säännöt säilyvät ennallaan. Haluatko varmasti jatkaa?

// Security

450 = Tietoturva
451 = Määritä alla Windows Firewall Controllin toteuttamat tietoturvakäytönnöt
452 = Turvattu käynnistys
453 = Asettaa automaattisesti korkean suodatusprofiilin käyttöön järjestelmän sammuessa. Windowsin käynnistyessä, verkkoyhteydet estetään, kunnes käyttäjä vaihtaa suodatusprofiilia.
454 = Turvatut säännöt
455 = Poista automaattisesti palomuurin säännöt, jotka eivät kuulu alla määriteltyihin valtuutettuihin ryhmiin
456 = Valtuutetut ryhmät
457 = Lisää ryhmä
458 = Poista ryhmä
459 = Määritä alla uusi valtuutettu ryhmä
460 = Varoitus. Ennen toiminnon käyttöön ottoa, kaikki valtuutetut ryhmät tulee olla määriteltyinä. Muussa tapauksessa säännöt, jotka eivät kuulu valtuutettuun ryhmään poistetaan. Varmuuskopion tekeminen säännöistä on suositeltavaa. Haluatko varmasti jatkaa ?
461 = Tuo ryhmät nykyisitä säännöistä
462 = Valtuuttamattomat ryhmät tulisi automaattisesti
463 = poistaa
464 = poistaa käytöstä
465 = Käytä yhtä @ ohittaaksesi palomuurin säännöt Windows 10 sovelluksilta
466 = Havaittiin sääntöjä ilman ryhmiä. Säilyttääksesi nämä säännöt, haluatko lisätä ne Windows Firewall Controllin ryhmään ennen turvattujen sääntöken käyttöön ottamista?
467 = Valtuuta ryhmä
470 = Turvattu profiili
471 = Suojaa Windowsin palomuurin tila ulkoiselta manipuloinnilta
475 = Poista valtuuttamattomat säännöt
476 = Poista käytöstä valtuuttamattomat säännöt
477 = Salli Windows Store säännöt


// Tools

501 = Alla olevista linkeistä voit käynnistää eri järjestelmän apuohjelmia. Huomioi, että nämä ohjelmat suoritetaan korkeimmilla käytettävissä olevilla oikeuksilla.
502 = Windowsin laajennettu palomuuri
503 = Tapahtumaloki
504 = Resurssien seuranta
505 = Windowsin palomuurin ohjauspaneeli
510 = Alla voit määrittää URL-osoitteet palveluille, joita voit käyttää eri tietojen todentamisessa.
511 = URL-osoite IP-osoitteen maineen tarkastamiseen
512 = URL-osoite tiedoston tarkistamiseen perustuen tiedoston SHA256-tiivisteeseen
513 = URL-osoite WHOIS-kyselyn tekoon
514 = URL-osoite yksittäisen portin lisätietoihin
520 = Kopioi...
521 = Kaikki

// About

601 = Tietoja ohjelmasta
602 = Tarkista onko uutta versiota saatavilla
603 = Ei voitu yhdistää päivityspalvelimeen. Tarkasta, että olet sallinut ohjelman riittävillä säännöillä ja, jos käytät välityspalvelinta, tarkasta, että sinulla on käytössä oikeat välityspalvelimen asetukset.
605 = Käytät viimeisintä versiota. Uutta versiota ei ole saatavilla tällä hetkellä.
606 = Uusi versio Windows Firewall Controllista on saatavilla
607 = Halautko päivittää uuteen versioon?
608 = Näytä muutosloki
609 = Aktivoinnin tila
610 = Tuote on aktivoitu
611 = Tuote ei ole aktivoitu
612 = Kiitos tuestasi
613 = Aktivoi klikkaamalla tätä
614 = Alla on automaattisesti asennuksen yhteydessä luotu asennuksen ID-tunnus. Syötä alla olevaan tekstikenttään ID:tä vastaava aktivointikoodi, minkä jälkeen voit aktivoida ohjelman painamalla aktivointi-painiketta. Aktivointikoodin saat kirjautumalla sisään käyttäjätilillesi verkkosivuillamme.
615 = Avaa kirjautumissivu klikkaamalla tätä
616 = Asennuksen ID
617 = Aktivointikoodi
618 = Aktivoi
619 = Kopioi leikepöydälle
620 = Liitä leikepöydältä
621 = Liittymätyypit
622 = Kaikki liittymätyypit
623 = Valittu liittymätyyppi
624 = Lähiverkko
625 = Etähallinta
626 = Langaton
627 = Sisään
628 = Ulos
629 = Molemmat
640 = Edge traversal
641 = ICMP-asetukset
642 = Lukitse ensimmäinen sarake
680 = Merkinnät
681 = Kaikki merkinnät
682 = Viimeisin merkintä
690 = Tarkista päivitykset automaattisesti
691 = Käytä välityspalvelinta
692 = Välityspalvelimen asetukset
693 = Osoite
694 = Käyttäjänimi
695 = Salasana
699 = Isäntäprosessi

// Manage Rules

700 = Prosessin ID
701 = Nimi
702 = Ryhmä
703 = Ohjelma
704 = Sijainti
705 = Käytössä
706 = Toiminto
707 = Yhteyssuunta
708 = Lähdeosoite
709 = Lähdeportti
710 = Kohdeosoite
711 = Kohdeportti
712 = Protokolla
713 = Palvelu
714 = Kuvaus
715 = Luontiaika
716 = Toiminnot
717 = Päivitä lista
718 = Näytä epäkelvot säännöt
719 = Tyhjennä loki
720 = Hallitse sääntöjä
721 = Yhteysloki
722 = Sääntöjen luontityökalu
723 = Näytä
724 = Näytä
725 = Viimeiset 100 yhteyttä
726 = Viimeiset 500 yhteyttä
727 = Kaikki yhteydet
728 = yhteydet
729 = Sarakkeiden asetukset
730 = Näytetään
731 = sääntöä
732 = Kaikki säännöt
733 = Saapuvat säännöt
734 = Lähtevät säännöt
735 = Käyttäjän tekemät säännöt
736 = Suodata
737 = Ei suodatusta
738 = Säännöt käytössä
739 = Säännöt pois käytöstä
740 = Etsi
741 = Kirjaa yhdeydet lokiin
742 = Määritykset
743 = Tuo säännöt tiedostosta
744 = Vie kaikki säännöt
745 = Vie valitut säännöt
746 = Palauta olteussäännöt
747 = Palauta suositetut säännöt
748 = Sallitut yhteydet
749 = Estetyt yhteydet
750 = Tee uusi sääntö
751 = Selaa sallitaksesi
752 = Klikkaa sallitaksesi
753 = Selaa estääksesi
754 = Klikkaa estääksesi
755 = Salli tämä ohjelma
756 = Estä tämä ohjelma
757 = Tyhjä sääntö
758 = Muokkaa ja luo
759 = Poistamalla käytöstä estetyiden yhteyksien kirjaamisen, poistuu samalla käytöstä ilmoitukset. Haluatko varmasti jatkaa?
760 = Asetukset
761 = Salli
762 = Estä
763 = Ota käyttöön
764 = Poista käytöstä
765 = Poista
766 = Ominaisuudet
767 = Tee kaksoiskappale
768 = Yleiset
769 = Lisäasetukset
770 = Käytä
771 = Protokollat ja portit
772 = Paikallinen ja etä IP osoitteet
773 = Saapuva
774 = Lähteävä
775 = Toimialue
776 = Yksityinen
777 = Julkinen
778 = Kaikki
779 = Luo
780 = Mikä tahansa
781 = Kaikki Portit
782 = Tietyt portit
783 = Tietyt osoitteet
784 = Kaikki ohjelmat
785 = Tämä ohjelma
786 = Selaa...
787 = Esim: 80,443,9-29
788 = Esim: 50.87.146.202
790 = Valitse kansio, josta haluat etsiä ohjelmien käynnistystiedostoja
791 = tiedostot
792 = Lataa tiedot uudelleen painamalla päivitä-painiketta tai F5
793 = Ole hyvä ja odota...
794 = Lisää ryhmään
795 = Tyhjennä lajittelu
796 = Yhteydet
797 = Viimeksi estetyt
798 = Viimeksi sallitut
799 = Näytä päälekkäiset säännöt

// Notification Dialog

800 = Lähtevä yhteys estetty
801 = Lähde
802 = Kohde
803 = Allekirjoitus
804 = Kohteen IP
805 = Muokkaa sääntöä ennen sen luomista
806 = Salli ohjelma
807 = Salli aina tämän ohjelman yhdistää internettiin
808 = Estä ohjelma
809 = Estä aina tätä ohjelmaa yhdistämästä internettiin
810 = Estä nyt ja kysy uudelleen myöhemmin
811 = Salli tilapäisesti
812 = Tarkasta tiedosto
813 = Aloita WHOIS-kysely
814 = Todenna IP-osoite
815 = Avaa tiedoston sijainti
816 = Kopioi koko sijainti leikepöydälle
817 = Kopioi tiedostonimi leikepöydälle
818 = Näytä lisätietoja portista
819 = Takaisin säännön tietoihin
823 = Salli tilapäisesti
824 = Estä tilapäisesti
825 = WFC:n uudelleen käynnistykseen asti
830 = Yhdistä säännöt
831 = Yhdistetty sääntö
840 = Käytä kaikille ohjelmille ja palveluille
841 = Käytä ainoastaan palveluille
850 = Lähdeosoite
851 = Lähdeportti
852 = Kohdeosoite
853 = Kohdeportti

// Validations

920 = Anna nimi säännölle
921 = Tyhjät välit eivät ole sallittuja
922 = Portin tulee olla arvo väliltä 0 ja 65535
923 = Anna kelvollinen IP-alue
924 = Anna kelvollinen IP-osoite
925 = Päällekkäiset arvot eivät ole sallittuja
926 = Tyhjät arvot eivät ole sallittuja
927 = Negatiiviset arvot eivät ole sallittuja
928 = Epäkelpo portin arvoväli
929 = Kenttä ei saa olla tyhjä
930 = Tiedostoa ei löydy
931 = Tuetut tiedostomuodot
932 = Anna numeerinen arvo väliltä 0 ja 999
933 = Epäkelpo aliverkonpeite
934 = Anna numeerinen arvo väliltä 1 ja 60
935 = Vaadittu kenttä
936 = Epäkelpo sääntö. Ohjelmaa, johon sääntö on tehty, ei löytynyt levyltä.
940 = Ei voitu yhdistää Windows Firewall Controllin palveluun

// Uninstall

950 = Poista ohjelma
951 = Tämä poistaa ohjelman tietokoneeltasi. Valitse, mitä haluat tehdä nykyisille Windowsin palomuurin asetuksille:
952 = Palauta Windowsin palomuurin oletusarvoiset asetukset. Kaikki käyttäjän tekemät säännöt poistetaan ja vain Windowsin palomuurin oletusarvoiset säännöt säilytetään.
953 = Palauta tilaan ennen tämän ohjelman asentamista. Kaikki entiset säännöt, jotka tallennettiin ohjelman asentamisen yhteydessä, palautetaan.
954 = Säilytä nykyiset palomuurin säännöt ja asetukset. Poista pelkästään tämä ohjelma säilyttäen kaikki muut asetukset ja säännöt, kuten ne ovat tällä hetkellä.
955 = Poista aktivoinnin tila
956 = Ota Windowsin palomuurin kirjaaminen pois käytöstä
957 = Ohjelmaa poistetaan...
958 = Ohjelman poistaminen on estetty koska ohjelma on lukittu salasanalla. Avaa lukitus ja yritä uudelleen.